@gagantrivedi This is self-hosted, using the latest terraform provider version 0.5.1.  The error happens during `terraform apply`.  Here's a complete example:

Terraform:
```
resource "flagsmith_feature" "test_trailing_newline" {
  feature_name = "test_trailing_newline"
  project_uuid = var.project_uuid
  description  = ""
  type         = "STANDARD"
}

resource "flagsmith_feature_state" "test_trailing_newline_flagsmith" {
  enabled         = true
  environment_key = "..."
  feature_id      = flagsmith_feature.test_trailing_newline.id
  feature_state_value = {
    type         = "unicode"
    string_value = "line1\nline2\n"
  }
}
```

Running `terraform apply`:
```
# terraform apply
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # flagsmith_feature.test_trailing_newline will be created
  + resource "flagsmith_feature" "test_trailing_newline" {
      + default_enabled = false
      + feature_name    = "test_trailing_newline"
      + id              = (known after apply)
      + initial_value   = (known after apply)
      + is_archived     = (known after apply)
      + project_id      = (known after apply)
      + project_uuid    = "01f0c7e6-60ba-46ae-a6bf-05f3c4e5b85f"
      + type            = "STANDARD"
      + uuid            = (known after apply)
    }

  # flagsmith_feature_state.test_trailing_newline_flagsmith will be created
  + resource "flagsmith_feature_state" "test_trailing_newline_flagsmith" {
      + enabled             = true
      + environment_id      = (known after apply)
      + environment_key     = (sensitive value)
      + feature_id          = (known after apply)
      + feature_segment_id  = (known after apply)
      + feature_state_value = {
          + string_value = <<-EOT
                line1
                line2
            EOT
          + type         = "unicode"
        }
      + id                  = (known after apply)
      + segment_priority    = (known after apply)
      + uuid                = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

flagsmith_feature.test_trailing_newline: Creating...
flagsmith_feature.test_trailing_newline: Creation complete after 1s
flagsmith_feature_state.test_trailing_newline_flagsmith: Creating...
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to flagsmith_feature_state.test_trailing_newline_flagsmith, provider "provider[\"registry.terraform.io/flagsmith/flagsmith\"]"
│ produced an unexpected new value: .feature_state_value.string_value: was cty.StringVal("line1\nline2\n"), but now cty.StringVal("line1\nline2").
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
```